# Напишите программу, в которой сравниваются три введенных значения. Сравните их друг с
# другом. Если значения совпадают то выведите True, а если нет, то False.

number1 = input()
number2 = input()
number3 = input()

if number1 == number2 == number3:
    print(True)
else: 
    print(False)