# Напишите программу, в которой сравниваются два введенных значения. Если они совпадают
# то выведите True, а если нет, то False.


number1 = input()
number2 = input()


if number1 == number2:
    print(True)
else:
    print(False)
